// TypeScript: Привет, Мир!
// Особенности запуска
// По традиции начнем с написания программы 'Hello, World!'. 
// Эта программа будет выводить на экран текст:

//   Hello, World!

// Чтобы вывести что-то на экран, нужно дать компьютеру специальную команду. 
// В языке TypeScript такая команда — console.log().

// Особенности запуска
// Компилятор TypeScript медленнее чем нужно для отработки практики на code-basics. 
// Из-за этого, ошибки TypeScript в этом курсе показываются только в самом редакторе (подсвечиваются красным и при наведении раскрываются). 
// Во время запуска практики показываются только ошибки JavaScript. 
// Это значит, что перед тем, как запускать код на проверку, нужно будет убедиться в том, что в редакторе нет красных подчеркиваний.

// Если вы хотите проверить примеры у себя на компьютере, для корректного поведения, убедитесь, что используете флаг --strict.

// Задание
// Наберите в редакторе код из задания символ в символ и нажмите «Проверить».

console.log('Hello, World!');